In [ ]:
import pandas as pd

#### 1. Read CSV file.

In [ ]:
titanic = pd.read_csv("datasets/titanic.csv")
titanic

#### 2. Display Options

In [ ]:
# pandas default max row displaying
pd.options.display.max_rows

In [ ]:
# pandas default min row displaying
pd.options.display.min_rows

In [ ]:
# change the default
pd.options.display.min_rows = 30
titanic

In [ ]:
# make pandas display all the rows of the titanic.csv
# pd.options.display.max_rows = 891
# titanic

In [ ]:
# get first rows
# by default head() takes first 5 rows, but we can change it.
head = titanic.head(10) 
head

In [ ]:
# get last rows
# by default tail() takes last 5 rows, but we can change it.
tail = titanic.tail(7)
tail

#### 3. Data Inspection

In [ ]:
titanic.info()

In [ ]:
# describe() method provide some summary statistic on numerical columns
# count is the number of NON missing values
# the mean in susrvived column is the survivor rate in %
titanic.describe()

In [ ]:
# get the columns with non numerical values
# unique stands for the unique values in this column, most frequents value is "male"=577
titanic.describe(include="O")

#### 4. Built-in Functions

In [ ]:
type(titanic)

In [ ]:
# how many rows the DF has
len(titanic)

In [ ]:
# round all numerical values to, two digits after the decimal point
round(titanic, 2)

 - Python Built-in functions are limited for the DataFrame, so we use some DF attributes and methods 
    - DataFrame Attributes:

In [ ]:
# shape, showe how many rows and how many columns
titanic.shape

In [ ]:
# shows how many elements we have = (891 rows * 9 columns = 8019)
titanic.size

In [ ]:
titanic.index

In [ ]:
# displays all column labels
titanic.columns

  - DataFrames Methods:

In [ ]:
# 1st tow rows
titanic.head(n = 2)

In [ ]:
# displays minimun value of all numeric value columns
titanic.min(numeric_only=True)

  - Method Chaining

In [ ]:
# average estimation
titanic.mean(numeric_only=True)

In [ ]:
# sort the values from lowes to highest
titanic.mean(numeric_only=True).sort_values()

In [ ]:
# only first, two lables
titanic.mean(numeric_only=True).sort_values().head(2)

In [ ]:
titanic.sort_values(by = "age",)

#### 5. Columns Selections

In [34]:
pd.options.display.max_rows = 10
# this is pandas Series (showing one column one row)
print(type(titanic["age"]))
titanic["age"]

<class 'pandas.core.series.Series'>

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [39]:
titanic["age"].describe()
# same as get statistic info about specific column
titanic.age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [40]:
# select more than one column
titanic[["age", "sex", "pclass"]]

      age     sex  pclass
0    22.0    male       3
1    38.0  female       1
2    26.0  female       3
3    35.0  female       1
4    35.0    male       3
..    ...     ...     ...
886  27.0    male       2
887  19.0  female       1
888   NaN  female       3
889  26.0    male       1
890  32.0    male       3

[891 rows x 3 columns]

In [45]:
# we can switch places
titanic[["sex", "age"]]

        sex   age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

In [44]:
# Number of missing values in Age column
titanic["age"].isnull().sum()

177